espressif/esp-idf/components/soc/esp32h4/register/soc/zero_det_reg.h
/** ZERO_DET_CHANNEL_1_TIMER0_REG register
 *  record timer reg
 */
#define ZERO_DET_CHANNEL_1_TIMER0_REG (DR_REG_ZERO_BASE + 0x20)
/** ZERO_DET_CHANNEL_1_TIMER0 : RO; bitpos: [31:0]; default: 0;
 *  record the time while detect the first zero det int  in channel 1
 */
#define ZERO_DET_CHANNEL_1_TIMER0    0xFFFFFFFFU
#define ZERO_DET_CHANNEL_1_TIMER0_M  (ZERO_DET_CHANNEL_1_TIMER0_V << ZERO_DET_CHANNEL_1_TIMER0_S)
#define ZERO_DET_CHANNEL_1_TIMER0_V  0xFFFFFFFFU
#define ZERO_DET_CHANNEL_1_TIMER0_S  0

/** ZERO_DET_CHANNEL_1_TIMER1_REG register
 *  record timer reg
 */
#define ZERO_DET_CHANNEL_1_TIMER1_REG (DR_REG_ZERO_BASE + 0x24)
/** ZERO_DET_CHANNEL_1_TIMER1 : RO; bitpos: [31:0]; default: 0;
 *  record the time while detect the second zero det int  in channel 1
 */
#define ZERO_DET_CHANNEL_1_TIMER1    0xFFFFFFFFU
#define ZERO_DET_CHANNEL_1_TIMER1_M  (ZERO_DET_CHANNEL_1_TIMER1_V << ZERO_DET_CHANNEL_1_TIMER1_S)
#define ZERO_DET_CHANNEL_1_TIMER1_V  0xFFFFFFFFU
#define ZERO_DET_CHANNEL_1_TIMER1_S  0

/** ZERO_DET_CHANNEL_2_TIMER0_REG register
 *  record timer reg
 */
#define ZERO_DET_CHANNEL_2_TIMER0_REG (DR_REG_ZERO_BASE + 0x28)
/** ZERO_DET_CHANNEL_2_TIMER0 : RO; bitpos: [31:0]; default: 0;
 *  record the time while detect the first zero det int  in channel 2
 */
#define ZERO_DET_CHANNEL_2_TIMER0    0xFFFFFFFFU
#define ZERO_DET_CHANNEL_2_TIMER0_M  (ZERO_DET_CHANNEL_2_TIMER0_V << ZERO_DET_CHANNEL_2_TIMER0_S)
#define ZERO_DET_CHANNEL_2_TIMER0_V  0xFFFFFFFFU
#define ZERO_DET_CHANNEL_2_TIMER0_S  0

/** ZERO_DET_CHANNEL_2_TIMER1_REG register
 *  record timer reg
 */
#define ZERO_DET_CHANNEL_2_TIMER1_REG (DR_REG_ZERO_BASE + 0x2c)
/** ZERO_DET_CHANNEL_2_TIMER1 : RO; bitpos: [31:0]; default: 0;
 *  record the time while detect the second zero det int  in channel 2
 */
#define ZERO_DET_CHANNEL_2_TIMER1    0xFFFFFFFFU
#define ZERO_DET_CHANNEL_2_TIMER1_M  (ZERO_DET_CHANNEL_2_TIMER1_V << ZERO_DET_CHANNEL_2_TIMER1_S)
#define ZERO_DET_CHANNEL_2_TIMER1_V  0xFFFFFFFFU
#define ZERO_DET_CHANNEL_2_TIMER1_S  0

/** ZERO_DET_CHANNEL_3_TIMER0_REG register
 *  record timer reg
 */
#define ZERO_DET_CHANNEL_3_TIMER0_REG (DR_REG_ZERO_BASE + 0x30)
/** ZERO_DET_CHANNEL_3_TIMER0 : RO; bitpos: [31:0]; default: 0;
 *  record the time while detect the first zero det int  in channel 3
 */
#define ZERO_DET_CHANNEL_3_TIMER0    0xFFFFFFFFU
#define ZERO_DET_CHANNEL_3_TIMER0_M  (ZERO_DET_CHANNEL_3_TIMER0_V << ZERO_DET_CHANNEL_3_TIMER0_S)
#define ZERO_DET_CHANNEL_3_TIMER0_V  0xFFFFFFFFU
#define ZERO_DET_CHANNEL_3_TIMER0_S  0

/** ZERO_DET_CHANNEL_3_TIMER1_REG register
 *  record timer reg
 */
#define ZERO_DET_CHANNEL_3_TIMER1_REG (DR_REG_ZERO_BASE + 0x34)
/** ZERO_DET_CHANNEL_3_TIMER1 : RO; bitpos: [31:0]; default: 0;
 *  record the time while detect the second zero det int  in channel 3
 */
#define ZERO_DET_CHANNEL_3_TIMER1    0xFFFFFFFFU
#define ZERO_DET_CHANNEL_3_TIMER1_M  (ZERO_DET_CHANNEL_3_TIMER1_V << ZERO_DET_CHANNEL_3_TIMER1_S)
#define ZERO_DET_CHANNEL_3_TIMER1_V  0xFFFFFFFFU
#define ZERO_DET_CHANNEL_3_TIMER1_S  0

/** ZERO_DET_CHANNEL_STATUS_REG register
 *  pad comp status reg
 */
#define ZERO_DET_CHANNEL_STATUS_REG (DR_REG_ZERO_BASE + 0x38)
/** ZERO_DET_CHANNEL_3_PAD_COMP_STATUS : RO; bitpos: [0]; default: 0;
 *  record the pad comp status for channel 3, 0 means now is neg int , 1 means now is
 *  pos int
 */
#define ZERO_DET_CHANNEL_3_PAD_COMP_STATUS    (BIT(0))
#define ZERO_DET_CHANNEL_3_PAD_COMP_STATUS_M  (ZERO_DET_CHANNEL_3_PAD_COMP_STATUS_V << ZERO_DET_CHANNEL_3_PAD_COMP_STATUS_S)
#define ZERO_DET_CHANNEL_3_PAD_COMP_STATUS_V  0x00000001U
#define ZERO_DET_CHANNEL_3_PAD_COMP_STATUS_S  0
/** ZERO_DET_CHANNEL_2_PAD_COMP_STATUS : RO; bitpos: [1]; default: 0;
 *  record the pad comp status for channel 2, 0 means now is neg int , 1 means now is
 *  pos int
 */
#define ZERO_DET_CHANNEL_2_PAD_COMP_STATUS    (BIT(1))
#define ZERO_DET_CHANNEL_2_PAD_COMP_STATUS_M  (ZERO_DET_CHANNEL_2_PAD_COMP_STATUS_V << ZERO_DET_CHANNEL_2_PAD_COMP_STATUS_S)
#define ZERO_DET_CHANNEL_2_PAD_COMP_STATUS_V  0x00000001U
#define ZERO_DET_CHANNEL_2_PAD_COMP_STATUS_S  1
/** ZERO_DET_CHANNEL_1_PAD_COMP_STATUS : RO; bitpos: [2]; default: 0;
 *  record the pad comp status for channel 1, 0 means now is neg int , 1 means now is
 *  pos int
 */
#define ZERO_DET_CHANNEL_1_PAD_COMP_STATUS    (BIT(2))
#define ZERO_DET_CHANNEL_1_PAD_COMP_STATUS_M  (ZERO_DET_CHANNEL_1_PAD_COMP_STATUS_V << ZERO_DET_CHANNEL_1_PAD_COMP_STATUS_S)
#define ZERO_DET_CHANNEL_1_PAD_COMP_STATUS_V  0x00000001U
#define ZERO_DET_CHANNEL_1_PAD_COMP_STATUS_S  2

/** ZERO_DET_PAD_COMP_CFG_REG register
 *  pad comp cfg reg
 */
#define ZERO_DET_PAD_COMP_CFG_REG (DR_REG_ZERO_BASE + 0x3c)
/** ZERO_DET_PAD_COMP_HYS : R/W; bitpos: [2:0]; default: 0;
 *  hys cfg signal
 */
#define ZERO_DET_PAD_COMP_HYS    0x00000007U
#define ZERO_DET_PAD_COMP_HYS_M  (ZERO_DET_PAD_COMP_HYS_V << ZERO_DET_PAD_COMP_HYS_S)
#define ZERO_DET_PAD_COMP_HYS_V  0x00000007U
#define ZERO_DET_PAD_COMP_HYS_S  0
/** ZERO_DET_PAD_COMP_HYS_EN : R/W; bitpos: [3]; default: 0;
 *  enable hys function,only works while pad comp mode = 0
 */
#define ZERO_DET_PAD_COMP_HYS_EN    (BIT(3))
#define ZERO_DET_PAD_COMP_HYS_EN_M  (ZERO_DET_PAD_COMP_HYS_EN_V << ZERO_DET_PAD_COMP_HYS_EN_S)
#define ZERO_DET_PAD_COMP_HYS_EN_V  0x00000001U
#define ZERO_DET_PAD_COMP_HYS_EN_S  3
/** ZERO_DET_PAD_COMP_DREF : R/W; bitpos: [6:4]; default: 0;
 *  internal vref cfg signal,0~2.3v step is 330mv
 */
#define ZERO_DET_PAD_COMP_DREF    0x00000007U
#define ZERO_DET_PAD_COMP_DREF_M  (ZERO_DET_PAD_COMP_DREF_V << ZERO_DET_PAD_COMP_DREF_S)
#define ZERO_DET_PAD_COMP_DREF_V  0x00000007U
#define ZERO_DET_PAD_COMP_DREF_S  4
/** ZERO_DET_PAD_COMP_MODE : R/W; bitpos: [7]; default: 0;
 *  pad comp mode cfg 1:external pad 0:internal vref
 */
#define ZERO_DET_PAD_COMP_MODE    (BIT(7))
#define ZERO_DET_PAD_COMP_MODE_M  (ZERO_DET_PAD_COMP_MODE_V << ZERO_DET_PAD_COMP_MODE_S)
#define ZERO_DET_PAD_COMP_MODE_V  0x00000001U
#define ZERO_DET_PAD_COMP_MODE_S  7
/** ZERO_DET_PAD_COMP_XPD : R/W; bitpos: [8]; default: 0;
 *  pad comp xpd
 */
#define ZERO_DET_PAD_COMP_XPD    (BIT(8))
#define ZERO_DET_PAD_COMP_XPD_M  (ZERO_DET_PAD_COMP_XPD_V << ZERO_DET_PAD_COMP_XPD_S)
#define ZERO_DET_PAD_COMP_XPD_V  0x00000001U
#define ZERO_DET_PAD_COMP_XPD_S  8

/** ZERO_DET_DATE_REG register
 *  date reg
 */
#define ZERO_DET_DATE_REG (DR_REG_ZERO_BASE + 0x40)
/** ZERO_DET_DATE : R/W; bitpos: [27:0]; default: 37773696;
 *  zero det reg change date
 */
#define ZERO_DET_DATE    0x0FFFFFFFU
#define ZERO_DET_DATE_M  (ZERO_DET_DATE_V << ZERO_DET_DATE_S)
#define ZERO_DET_DATE_V  0x0FFFFFFFU
#define ZERO_DET_DATE_S  0
/** ZERO_DET_CLK_EN : R/W; bitpos: [28]; default: 0;
 *  reg clk en
 */
#define ZERO_DET_CLK_EN    (BIT(28))
#define ZERO_DET_CLK_EN_M  (ZERO_DET_CLK_EN_V << ZERO_DET_CLK_EN_S)
#define ZERO_DET_CLK_EN_V  0x00000001U
#define ZERO_DET_CLK_EN_S  28

#ifdef __cplusplus
}
#endif
